XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_rtc.h
#define    RTC_ISR_16HZ_IF_Pos                                   (7U)
#define    RTC_ISR_16HZ_IF_Msk                                   (0x1U << RTC_ISR_16HZ_IF_Pos)
#define    RTC_ISR_16HZ_IF                                       RTC_ISR_16HZ_IF_Msk

#define    RTC_ISR_8HZ_IF_Pos                                    (6U)
#define    RTC_ISR_8HZ_IF_Msk                                    (0x1U << RTC_ISR_8HZ_IF_Pos)
#define    RTC_ISR_8HZ_IF                                        RTC_ISR_8HZ_IF_Msk

#define    RTC_ISR_4HZ_IF_Pos                                    (5U)
#define    RTC_ISR_4HZ_IF_Msk                                    (0x1U << RTC_ISR_4HZ_IF_Pos)
#define    RTC_ISR_4HZ_IF                                        RTC_ISR_4HZ_IF_Msk

#define    RTC_ISR_2HZ_IF_Pos                                    (4U)
#define    RTC_ISR_2HZ_IF_Msk                                    (0x1U << RTC_ISR_2HZ_IF_Pos)
#define    RTC_ISR_2HZ_IF                                        RTC_ISR_2HZ_IF_Msk

#define    RTC_ISR_SEC_IF_Pos                                    (3U)
#define    RTC_ISR_SEC_IF_Msk                                    (0x1U << RTC_ISR_SEC_IF_Pos)
#define    RTC_ISR_SEC_IF                                        RTC_ISR_SEC_IF_Msk

#define    RTC_ISR_MIN_IF_Pos                                    (2U)
#define    RTC_ISR_MIN_IF_Msk                                    (0x1U << RTC_ISR_MIN_IF_Pos)
#define    RTC_ISR_MIN_IF                                        RTC_ISR_MIN_IF_Msk

#define    RTC_ISR_HOUR_IF_Pos                                   (1U)
#define    RTC_ISR_HOUR_IF_Msk                                   (0x1U << RTC_ISR_HOUR_IF_Pos)
#define    RTC_ISR_HOUR_IF                                       RTC_ISR_HOUR_IF_Msk

#define    RTC_ISR_DAY_IF_Pos                                    (0U)
#define    RTC_ISR_DAY_IF_Msk                                    (0x1U << RTC_ISR_DAY_IF_Pos)
#define    RTC_ISR_DAY_IF                                        RTC_ISR_DAY_IF_Msk

#define    RTC_TMSEL_TMSEL_Pos                                   (0U)
#define    RTC_TMSEL_TMSEL_Msk                                   (0xfU << RTC_TMSEL_TMSEL_Pos)
#define    RTC_TMSEL_TMSEL                                       RTC_TMSEL_TMSEL_Msk

#define    RTC_ADJUST_ADSIGN_Pos                                 (9U)
#define    RTC_ADJUST_ADSIGN_Msk                                 (0x1U << RTC_ADJUST_ADSIGN_Pos)
#define    RTC_ADJUST_ADSIGN                                     RTC_ADJUST_ADSIGN_Msk

#define    RTC_CR_EN_Pos                                         (0U)
#define    RTC_CR_EN_Msk                                         (0x1U << RTC_CR_EN_Pos)
#define    RTC_CR_EN                                             RTC_CR_EN_Msk






#define    FL_RTC_TIME_MARK_SECOND                               (0x2U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_MINUTE                               (0x3U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_HOUR                                 (0x4U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_DAY                                  (0x5U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_ALARM                                (0x6U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_32_SEC                               (0x7U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_SECOND_REVERSE                       (0x9U << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_MINUTE_REVERSE                       (0xaU << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_HOUR_REVERSE                         (0xbU << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_DAY_REVERSE                          (0xcU << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_ALARM_REVERSE                        (0xdU << RTC_TMSEL_TMSEL_Pos)
#define    FL_RTC_TIME_MARK_SEC                                  (0xfU << RTC_TMSEL_TMSEL_Pos)


#define    FL_RTC_ADJUST_DIR_INCREASE                            (0x0U << RTC_ADJUST_ADSIGN_Pos)
#define    FL_RTC_ADJUST_DIR_DECREASE                            (0x1U << RTC_ADJUST_ADSIGN_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup RTC_FL_Exported_Functions RTC Exported Functions
  * @{
  */

/**
  * @brief    Enable RTC Config Time
  * @rmtoll   WER        FL_RTC_WriteEnable
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteEnable(RTC_Type *RTCx)
{
    RTCx->WER = 0xACACACAC;
}

/**
  * @brief    Disable RTC Config Time
  * @rmtoll   WER        FL_RTC_WriteDisable
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_WriteDisable(RTC_Type *RTCx)
{
    RTCx->WER = 0x5A5A5A5A;
}

/**
  * @brief    Enable RTC Time Adjust Interrupt
  * @rmtoll   IER    ADJ_IE    FL_RTC_EnableIT_Adjust
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Adjust(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_ADJ_IE_Msk);
}

/**
  * @brief    Get RTC Time Adjust Interrupt Enable Status
  * @rmtoll   IER    ADJ_IE    FL_RTC_IsEnabledIT_Adjust
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Adjust(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_ADJ_IE_Msk) == RTC_IER_ADJ_IE_Msk);
}

/**
  * @brief    Disable RTC Time Adjust Interrupt
  * @rmtoll   IER    ADJ_IE    FL_RTC_DisableIT_Adjust
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Adjust(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_ADJ_IE_Msk);
}

/**
  * @brief    Enable RTC Alarm Interrupt
  * @rmtoll   IER    ALARM_IE    FL_RTC_EnableIT_Alarm
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Alarm(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_ALARM_IE_Msk);
}

/**
  * @brief    Get RTC Alarm Interrupt Enable Status
  * @rmtoll   IER    ALARM_IE    FL_RTC_IsEnabledIT_Alarm
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Alarm(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_ALARM_IE_Msk) == RTC_IER_ALARM_IE_Msk);
}

/**
  * @brief    Disable RTC Alarm    Interrupt
  * @rmtoll   IER    ALARM_IE    FL_RTC_DisableIT_Alarm
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Alarm(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_ALARM_IE_Msk);
}

/**
  * @brief    Enable RTC 1KHz Interrupt
  * @rmtoll   IER    1KHZ_IE    FL_RTC_EnableIT_1KHz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_1KHz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Get RTC 1KHz Interrupt Enable Status
  * @rmtoll   IER    1KHZ_IE    FL_RTC_IsEnabledIT_1KHz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_1KHz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_1KHZ_IE_Msk) == RTC_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Disable RTC 1KHz Interrupt
  * @rmtoll   IER    1KHZ_IE    FL_RTC_DisableIT_1KHz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_1KHz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_1KHZ_IE_Msk);
}

/**
  * @brief    Enable RTC 256Hz Interrupt
  * @rmtoll   IER    256HZ_IE    FL_RTC_EnableIT_256Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_256Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_256HZ_IE_Msk);
}

/**
  * @brief    Get RTC 256Hz Interrupt Enable Status
  * @rmtoll   IER    256HZ_IE    FL_RTC_IsEnabledIT_256Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_256Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_256HZ_IE_Msk) == RTC_IER_256HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 256Hz Interrupt
  * @rmtoll   IER    256HZ_IE    FL_RTC_DisableIT_256Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_256Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_256HZ_IE_Msk);
}

/**
  * @brief    Enable RTC 64Hz Interrupt
  * @rmtoll   IER    64HZ_IE    FL_RTC_EnableIT_64Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_64Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_64HZ_IE_Msk);
}

/**
  * @brief    Get RTC 64Hz Interrupt Enable Status
  * @rmtoll   IER    64HZ_IE    FL_RTC_IsEnabledIT_64Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_64Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_64HZ_IE_Msk) == RTC_IER_64HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 64Hz Interrupt
  * @rmtoll   IER    64HZ_IE    FL_RTC_DisableIT_64Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_64Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_64HZ_IE_Msk);
}

/**
  * @brief    Enable RTC 16Hz Interrupt
  * @rmtoll   IER    16HZ_IE    FL_RTC_EnableIT_16Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_16Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_16HZ_IE_Msk);
}

/**
  * @brief    Get RTC 16Hz Interrupt Enable Status
  * @rmtoll   IER    16HZ_IE    FL_RTC_IsEnabledIT_16Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_16Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_16HZ_IE_Msk) == RTC_IER_16HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 16Hz Interrupt
  * @rmtoll   IER    16HZ_IE    FL_RTC_DisableIT_16Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_16Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_16HZ_IE_Msk);
}

/**
  * @brief    Enable RTC 8Hz Interrupt
  * @rmtoll   IER    8HZ_IE    FL_RTC_EnableIT_8Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_8Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_8HZ_IE_Msk);
}

/**
  * @brief    Get RTC 8Hz Interrupt Enable Status
  * @rmtoll   IER    8HZ_IE    FL_RTC_IsEnabledIT_8Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_8Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_8HZ_IE_Msk) == RTC_IER_8HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 8Hz Interrupt
  * @rmtoll   IER    8HZ_IE    FL_RTC_DisableIT_8Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_8Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_8HZ_IE_Msk);
}

/**
  * @brief    Enable RTC 4Hz Interrupt
  * @rmtoll   IER    4HZ_IE    FL_RTC_EnableIT_4Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_4Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_4HZ_IE_Msk);
}

/**
  * @brief    Get RTC 4Hz Interrupt Enable Status
  * @rmtoll   IER    4HZ_IE    FL_RTC_IsEnabledIT_4Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_4Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_4HZ_IE_Msk) == RTC_IER_4HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 4Hz Interrupt
  * @rmtoll   IER    4HZ_IE    FL_RTC_DisableIT_4Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_4Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_4HZ_IE_Msk);
}

/**
  * @brief    Enable RTC 2Hz Interrupt
  * @rmtoll   IER    2HZ_IE    FL_RTC_EnableIT_2Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_2Hz(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_2HZ_IE_Msk);
}

/**
  * @brief    Get RTC 2Hz Interrupt Enable Status
  * @rmtoll   IER    2HZ_IE    FL_RTC_IsEnabledIT_2Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_2Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_2HZ_IE_Msk) == RTC_IER_2HZ_IE_Msk);
}

/**
  * @brief    Disable RTC 2Hz Interrupt
  * @rmtoll   IER    2HZ_IE    FL_RTC_DisableIT_2Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_2Hz(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_2HZ_IE_Msk);
}

/**
  * @brief    Enable RTC Second Interrupt
  * @rmtoll   IER    SEC_IE    FL_RTC_EnableIT_Second
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Second(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_SEC_IE_Msk);
}

/**
  * @brief    Get RTC Second Interrupt Enable Status
  * @rmtoll   IER    SEC_IE    FL_RTC_IsEnabledIT_Second
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Second(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_SEC_IE_Msk) == RTC_IER_SEC_IE_Msk);
}

/**
  * @brief    Disable RTC Second Interrupt
  * @rmtoll   IER    SEC_IE    FL_RTC_DisableIT_Second
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Second(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_SEC_IE_Msk);
}

/**
  * @brief    Enable RTC Minute Interrupt
  * @rmtoll   IER    MIN_IE    FL_RTC_EnableIT_Minute
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Minute(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_MIN_IE_Msk);
}

/**
  * @brief    Get RTC Minute Interrupt Enable Status
  * @rmtoll   IER    MIN_IE    FL_RTC_IsEnabledIT_Minute
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Minute(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_MIN_IE_Msk) == RTC_IER_MIN_IE_Msk);
}

/**
  * @brief    Disable RTC Minute Interrupt
  * @rmtoll   IER    MIN_IE    FL_RTC_DisableIT_Minute
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Minute(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_MIN_IE_Msk);
}

/**
  * @brief    Enable RTC Hour Interrupt
  * @rmtoll   IER    HOUR_IE    FL_RTC_EnableIT_Hour
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Hour(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_HOUR_IE_Msk);
}

/**
  * @brief    Get RTC Hour Interrupt Enable Status
  * @rmtoll   IER    HOUR_IE    FL_RTC_IsEnabledIT_Hour
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Hour(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_HOUR_IE_Msk) == RTC_IER_HOUR_IE_Msk);
}

/**
  * @brief    Disable RTC Hour  Interrupt
  * @rmtoll   IER    HOUR_IE    FL_RTC_DisableIT_Hour
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Hour(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_HOUR_IE_Msk);
}

/**
  * @brief    Enable RTC Day Interrupt
  * @rmtoll   IER    DAY_IE    FL_RTC_EnableIT_Day
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_EnableIT_Day(RTC_Type *RTCx)
{
    SET_BIT(RTCx->IER, RTC_IER_DAY_IE_Msk);
}

/**
  * @brief    Get RTC Day Interrupt Enable Status
  * @rmtoll   IER    DAY_IE    FL_RTC_IsEnabledIT_Day
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsEnabledIT_Day(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->IER, RTC_IER_DAY_IE_Msk) == RTC_IER_DAY_IE_Msk);
}

/**
  * @brief    Disable RTC Day Interrupt
  * @rmtoll   IER    DAY_IE    FL_RTC_DisableIT_Day
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_DisableIT_Day(RTC_Type *RTCx)
{
    CLEAR_BIT(RTCx->IER, RTC_IER_DAY_IE_Msk);
}

/**
  * @brief    Clear RTC Time Adjust Interrupt Flag
  * @rmtoll   ISR    ADJ_IF    FL_RTC_ClearFlag_Adjust
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Adjust(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_ADJ_IF_Msk);
}

/**
  * @brief    Get RTC Time Adjust Interrupt Flag
  * @rmtoll   ISR    ADJ_IF    FL_RTC_IsActiveFlag_Adjust
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Adjust(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_ADJ_IF_Msk) == (RTC_ISR_ADJ_IF_Msk));
}

/**
  * @brief    Clear RTC Alarm Interrupt Flag
  * @rmtoll   ISR    ALARM_IF    FL_RTC_ClearFlag_Alarm
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Alarm(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_ALARM_IF_Msk);
}

/**
  * @brief    Get RTC Alarm Interrupt Flag
  * @rmtoll   ISR    ALARM_IF    FL_RTC_IsActiveFlag_Alarm
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Alarm(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_ALARM_IF_Msk) == (RTC_ISR_ALARM_IF_Msk));
}

/**
  * @brief    Clear RTC 1KHz Interrupt Flag
  * @rmtoll   ISR    1KHZ_IF    FL_RTC_ClearFlag_1KHz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_1KHz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_1KHZ_IF_Msk);
}

/**
  * @brief    Get RTC 1KHz Interrupt Flag
  * @rmtoll   ISR    1KHZ_IF    FL_RTC_IsActiveFlag_1KHz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_1KHz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_1KHZ_IF_Msk) == (RTC_ISR_1KHZ_IF_Msk));
}

/**
  * @brief    Clear RTC 256Hz Interrupt Flag
  * @rmtoll   ISR    256HZ_IF    FL_RTC_ClearFlag_256Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_256Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_256HZ_IF_Msk);
}

/**
  * @brief    Get RTC 256Hz Interrupt Flag
  * @rmtoll   ISR    256HZ_IF    FL_RTC_IsActiveFlag_256Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_256Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_256HZ_IF_Msk) == (RTC_ISR_256HZ_IF_Msk));
}

/**
  * @brief    Clear RTC 64Hz Interrupt Flag
  * @rmtoll   ISR    64HZ_IF    FL_RTC_ClearFlag_64Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_64Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_64HZ_IF_Msk);
}

/**
  * @brief    Get RTC 64Hz Interrupt Flag
  * @rmtoll   ISR    64HZ_IF    FL_RTC_IsActiveFlag_64Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_64Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_64HZ_IF_Msk) == (RTC_ISR_64HZ_IF_Msk));
}

/**
  * @brief    Clear RTC 16Hz Interrupt Flag
  * @rmtoll   ISR    16HZ_IF    FL_RTC_ClearFlag_16Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_16Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_16HZ_IF_Msk);
}

/**
  * @brief    Get RTC 16Hz Interrupt Flag
  * @rmtoll   ISR    16HZ_IF    FL_RTC_IsActiveFlag_16Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_16Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_16HZ_IF_Msk) == (RTC_ISR_16HZ_IF_Msk));
}

/**
  * @brief    Clear RTC 8Hz Interrupt Flag
  * @rmtoll   ISR    8HZ_IF    FL_RTC_ClearFlag_8Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_8Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_8HZ_IF_Msk);
}

/**
  * @brief    Get RTC 8Hz Interrupt Flag
  * @rmtoll   ISR    8HZ_IF    FL_RTC_IsActiveFlag_8Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_8Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_8HZ_IF_Msk) == (RTC_ISR_8HZ_IF_Msk));
}

/**
  * @brief    Clear RTC 4Hz Interrupt Flag
  * @rmtoll   ISR    4HZ_IF    FL_RTC_ClearFlag_4Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_4Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_4HZ_IF_Msk);
}

/**
  * @brief    Get RTC 4Hz Interrupt Flag
  * @rmtoll   ISR    4HZ_IF    FL_RTC_IsActiveFlag_4Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_4Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_4HZ_IF_Msk) == (RTC_ISR_4HZ_IF_Msk));
}

/**
  * @brief    Clear RTC 2Hz Interrupt Flag
  * @rmtoll   ISR    2HZ_IF    FL_RTC_ClearFlag_2Hz
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_2Hz(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_2HZ_IF_Msk);
}

/**
  * @brief    Get RTC 2Hz Interrupt Flag
  * @rmtoll   ISR    2HZ_IF    FL_RTC_IsActiveFlag_2Hz
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_2Hz(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_2HZ_IF_Msk) == (RTC_ISR_2HZ_IF_Msk));
}

/**
  * @brief    Clear RTC Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTC_ClearFlag_Second
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Second(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_SEC_IF_Msk);
}

/**
  * @brief    Get RTC Second Interrupt Flag
  * @rmtoll   ISR    SEC_IF    FL_RTC_IsActiveFlag_Second
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Second(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_SEC_IF_Msk) == (RTC_ISR_SEC_IF_Msk));
}

/**
  * @brief    Clear RTC Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTC_ClearFlag_Minute
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Minute(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_MIN_IF_Msk);
}

/**
  * @brief    Get RTC Minute Interrupt Flag
  * @rmtoll   ISR    MIN_IF    FL_RTC_IsActiveFlag_Minute
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Minute(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_MIN_IF_Msk) == (RTC_ISR_MIN_IF_Msk));
}

/**
  * @brief    Clear RTC Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTC_ClearFlag_Hour
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Hour(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_HOUR_IF_Msk);
}

/**
  * @brief    Get RTC Hour Interrupt Flag
  * @rmtoll   ISR    HOUR_IF    FL_RTC_IsActiveFlag_Hour
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Hour(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_HOUR_IF_Msk) == (RTC_ISR_HOUR_IF_Msk));
}

/**
  * @brief    Clear RTC Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTC_ClearFlag_Day
  * @param    RTCx RTC instance
  * @retval   None
  */
__STATIC_INLINE void FL_RTC_ClearFlag_Day(RTC_Type *RTCx)
{
    WRITE_REG(RTCx->ISR, RTC_ISR_DAY_IF_Msk);
}

/**
  * @brief    Get RTC Day Interrupt Flag
  * @rmtoll   ISR    DAY_IF    FL_RTC_IsActiveFlag_Day
  * @param    RTCx RTC instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_RTC_IsActiveFlag_Day(RTC_Type *RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ISR, RTC_ISR_DAY_IF_Msk) == (RTC_ISR_DAY_IF_Msk));
}

